a = "Шляпка гриба, покрытая ... кожиц..й, держится на ... ножк.. . Снизу шляпка затянута ... плёнкой. Когда её уберёшь, откроется нижняя ... сторона шляпк.. ."
print(a)

b = input('Введите значение b: ')
c = input('Введите значение с: ')
d = input('Введите значение d: ')
e = input('Введите значение e: ')
f = input('Введите значение f: ')
k = input('Введите значение k: ')
n = input('Введите значение n: ')

a1 = f"Шляпка гриба, покрытая {b} кожиц{c}й, держится на {d} ножк{e}. Снизу шляпка затянута {f} пленкой. Когда её уберёшь, откроется нижняя {k} сторона шляпк{n}."
print(a1)